# 1. numpy를 가져온다
import numpy as np

# 2. 세로 3, 가로 4짜리 검은 흑백 사진을 만들어 img에 담는다
# img = np.zeros((3, 4, 3)) # np.zeros((세로, 가로, 점))
img = np.zeros((3, 4), np.uint8)
# 3. img를 print
print(img) # 가로는 4줄 세로는 3줄

# 4. img.shape를 print
print(img.shape) # shape의 역할: 표의 모양(크기) (3, 4, 3) = (세로, 가로, 칸하나에 숫자 몇 개)
# 칸 = 엑셀의 셀 하나 = 사진의 점 하나
# 흑백 사진은 셀 하나에 숫자 1개가 들어있음
# ex) 셀 하나: [120] <- "이 점은 이만큼 밝다"
# 컬러 사진은 셀 하나에 숫자 3개가 들어있음
# ex) 셀 하나: [0, 0, 255] <- "파랑 0, 초록 0, 빨강 255"
# shape ( 3, 4, 3) 마지막 3은 칸에 몇 개씩 들어있나

# 5. img[1, 2]에 255를 넣기 (흰색)
img[1, 2] = 255 # img[ 세로, 가로]

# 6. img를 다시 print
print(img) # 결국에 255는 밝기 수치인데 b=255, g=255, r=255면 하얀색
